{"modelTopology": {"keras_version": "2.1.5", "backend": "tensorflow", "training_config": {"sample_weight_mode": null, "loss": "categorical_crossentropy", "metrics": [], "loss_weights": null, "optimizer_config": {"class_name": "SGD", "config": {"nesterov": true, "momentum": 0.8999999761581421, "decay": 0.0, "lr": 0.0010000000474974513}}}, "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "batch_input_shape": [null, 64, 64, 3], "filters": 32, "activation": "relu", "name": "conv2d_21", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_constraint": null, "scale": true, "name": "batch_normalization_24", "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 32, "activation": "relu", "name": "conv2d_22", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_11", "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_16", "noise_shape": null, "seed": null, "rate": 0.25, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_constraint": null, "scale": true, "name": "batch_normalization_25", "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 64, "activation": "relu", "name": "conv2d_23", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_constraint": null, "scale": true, "name": "batch_normalization_26", "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 64, "activation": "relu", "name": "conv2d_24", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_12", "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_17", "noise_shape": null, "seed": null, "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_constraint": null, "scale": true, "name": "batch_normalization_27", "gamma_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 256, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "dense_11", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_18", "noise_shape": null, "seed": null, "rate": 0.5, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "center": true, "beta_constraint": null, "scale": true, "name": "batch_normalization_28", "gamma_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 3, "kernel_regularizer": null, "bias_regularizer": null, "activation": "softmax", "name": "dense_12", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null}}]}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_24/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_24/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_24/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_24/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_25/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_25/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_25/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_25/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_26/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_26/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_26/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_26/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_27/gamma", "shape": [10816], "dtype": "float32"}, {"name": "batch_normalization_27/beta", "shape": [10816], "dtype": "float32"}, {"name": "batch_normalization_27/moving_mean", "shape": [10816], "dtype": "float32"}, {"name": "batch_normalization_27/moving_variance", "shape": [10816], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_28/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_28/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_28/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_28/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "conv2d_21/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_21/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "conv2d_22/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_22/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "conv2d_23/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_23/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "conv2d_24/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_24/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group10-shard1of3", "group10-shard2of3", "group10-shard3of3"], "weights": [{"name": "dense_11/kernel", "shape": [10816, 256], "dtype": "float32"}, {"name": "dense_11/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "dense_12/kernel", "shape": [256, 3], "dtype": "float32"}, {"name": "dense_12/bias", "shape": [3], "dtype": "float32"}]}]}